app/controllers/images_controller.rb

SELECT  "images".* FROM "images" LIMIT ?  [["LIMIT", 1]]
---
  def index
    @images = Image.all

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @image = Image.find(params[:id])