app/views/images/index.html.erb

SELECT  "scores".* FROM "scores" WHERE "scores"."image_id" = ? ORDER BY time ASC LIMIT ?  [["image_id", 1], ["LIMIT", 5]]
---
          <h3> Highscores </h3>
          <% image.scores.take(5).each do |score| %>